
/*
                                                                   README


            Написать программу "Доставка еды на день"

    Пользователь должен иметь возможность выбрать рацион на день.
    Для этого ему необходимо выбрать 5 блюд на 5 приемов пищи (завтрак, обед и т.д.) и напиток.
    Причем ему не обязательно выбирать все пять.
    Программа должна подсчитать итоговое кол-во калорий и сумму заказа на день.
    Пользователь может выбрать время доставки и период (например, один день, неделя и т.д.)
    В таком случае должна быть показанна итоговая сумма кроме суммы за день.
    При большом периоде доставки предусмотреть наличие скидки.
    Кроме того, клиент может выбрат набор из пресетов
    (например, обед - 2 блюда и напиток, фитнес - 4 блюда и напиток, фулл - 5 блюд и напиток)

    Программу реализовать при помощи паттерна Строитель, для реализации наборов используйте Директора.


        GitHub:     https://github.com/Doronov-IV/Home-Assignments


*/

#include <iostream>

#include "App.h"


int main()
{
    srand(time(NULL));
    App* app = App::getInstance();
    app->run();
    system("pause>0");
    return 0;
}


